{
    "transcript": "Oh, since we last &gt;&gt; spoke. &gt;&gt; Got a new ornament this week. North Korea may have just revealed their new dictator after Kimmy. Spoiler, they're 13 years old. We've got the first pictures indicating that there might have been more than one Jeffrey Epstein. Donald Trump's past has got a whole lot more complicated yet again. Hollywood might be officially cooked yet again. And the UK hasn't seen the sun in 2026. I wish I could say yet again, but that is a first. All of that and so much more. Yes, we finally released the Canada video and you guys have been loving it and Alex. So, we'll be yapping more about that at the end of today's video. Let's stop the yapping and let's go. Pretty good. Okay, we've got to kick today's video off with something that people have been speculating about for years, but today we might finally have confirmation of who will be the next ruler of North Korea, and that changes a lot. So, it turns out, according to South Korea's spy agency, Kim Jong-un has chosen his daughter, 13-year-old Kim Ju, as his heir. Now, they believe this is the case because of a range of circumstances. Pick your pick your range of circumstances you would like to choose from. Circumstance one, if you decide to choose from it, will be increasing prominent public presence at official events. Circumstance two is voicing her opinion on certain state policies, which for perspective in North Korea to have an opinion at that level means you got to be someone otherwise done. Those are the only two circumstances that I I think would be picture. Now, obviously, Kim Ju only becomes the leader of North Korea when Kim dies. I guess that's the only alternative. And he is only 42 and he's one of the youngest leaders in the world actually. So, could be a while. But it also makes you think if it's not a while, what happens? What is North Korea's future? Because I mean, history is, you know, littered with just a couple of female dictators. So your question, will Kim Ju be a different leader to her father? You know, will she decide to open North Korea up to the world? What would that look like? I mean, we've never seen that in our lifetimes. Or plot twist, she may be even worse than Kim. And then we're really [&nbsp;__&nbsp;] &gt;&gt; Corn casserole. I guess only time will tell. But for now, moving on. Okay. Also, we've got a whole lot of updates on the Epstein situation. Starting with the first one which I found the most uh interesting. Was there more than one Jeffrey Epstein? Like one wasn't enough. Well, a US member of Congress, Representative Anna Paulina Luna, she posted something pretty insane on X this week which indicates Epstein had multiple identities. Now, we had heard mutterings of this all the way back in 2019 when they raided his [&nbsp;__&nbsp;] &gt;&gt; island. &gt;&gt; But this week, it looks like we have pictures for the first time. She wrote on X, \"Jeffrey Epstein was also Marius Robert Fort Elenni.\" This is an official possible with a different name that was released in the files. And yes, it is Epstein. Yep, that does look like him. And so I believe for the first time, we actually have pictures of these. And this is an Austrian passport with Epstein's face in it with dark hair. So what more can I say? That looks like a fake passport or the real passport and Jeffrey Epstein was his fake identity. Interestingly though, it shows that his residence is Saudi Arabia, and we'll talk more about the Middle East in a second. Luna also wrote a following up post saying before people tried to say that this is fake, the FBI was extensively running this, and communications from FBI showed that he had traveled back and forth to France quite a number of times with this very passport. Now, as I mentioned, we do already partially know that Epstein actually didn't have just this one, but multiple fake passports that he used to travel to various countries. This is just the first one that we've seen. But this also throws into doubt the FBI's narrative that Epstein did not run a trafficking ring to other people. Because I don't know, how many financeers do you know that just casually have multiple fake passports and identities? Not many. Not many or not any. &gt;&gt; Not any. &gt;&gt; Not any. Uh there could be a few shady financios out there. Something about cake pops. Okay, other updates. We have pretty disturbing development actually this week. Remember last week we were talking about the email that was sent about the torture video and that potentially some uh members of Congress were going to go and see these unredacted files. Well, guess what? They saw them and we actually have the name now. So, Representative Thomas Massie, who was one of the two that went to go see these unredacted versions, he said they only had about 2 hours, uh, and they discovered multiple interesting pieces of information. He posted on X that the DOJ tactically admitted that Sultan Ahmed bin Sulyam was the sender of said torture video. He said, \"Until tonight, no one knew who sent the torture video to Epstein. I went to DOJ, unredacted the email, and reverse searched the email to discover it was a Sultans. Now, the big question is, who is this guy, huh? Well, just a quick Google search shows that he is a wealthy and well-known businessman from Dubai who seems to have had a very close relationship with Epstein for many years. And again, it just shows you the network that Epstein had. Like, I don't know if there is a prominent city in the world where he didn't have a close friend. In fact, this Sultan's name comes up thousands of times in these files, including extensive conversations with Epstein from 2007 all the way up to 2019. And some of these conversations very graphic. To make it even more concerning, Suliam is the group chairman and CEO of DP World. That is a company which is one of the largest port and terminal operators in the world, handling about 10% of the globe's shipping containers. Yeah, friends with traffickers, shipping containers, not ideal. But I mean, the big question is what happens now? Like, how does this guy not get investigated by local authorities? I mean, how many ways could you interpret I liked the torture video, huh? Surely. Anyway, that is not even the end of the updates that we have about Epstein because we also got some pretty bombshell revelations from the files regarding Trump as well. So, in an interview with the FBI, which is part of these documents, uh the Florida police chief all the way back in 2009 claimed to the FBI, that Trump was one of the very first people to call the police when he had heard they were investigating Epstein. Trump apparently said, \"Thank goodness you're stopping him. Everyone has known he's been doing this.\" And also, he apparently said to this police chief that Glain Maxwell was Epstein's operative and that she is evil and to focus on her. But I mean, the most fascinating part of this is how the two sides of the media have been kind of covering the same information because it's kind of framed in a completely different way. On the one side, on the right, you have them reporting it like, you know, this just proves that Trump is the good guy. He was the one of the first people to to kind of alert the police about Jeffrey Epstein. He said that he thought the guy was a creep. And clearly, look at that. But then when you go and look at some of the headlines and reports on the other side, they said that this contradicts what Trump has said where he previously claimed that he did not know about Epstein's criminal actions. But they say that this kind of alludes to the fact that maybe he did and he even used the words everyone knew as well. So if what this officer said is true, they argue that Trump did know about Epstein's, you know, criminal actions and only spoke after Epstein was under investigation. But what do you guys think? Which side are you on? Or is both sides technically true? Make sure you put it in the comments. But for now, moving on. Also this week, Canada, which is unfortunate timing since we just had such an amazing Canada video only a couple of days ago, but uh they have experienced one of their deadliest school shootings in decades. On Tuesday, a gunman opened fire at Tumblr Ridge Secondary School, which is in a remote town of Tumblr Ridge, British Columbia. Now, reports say that this was shortly after killing two of their relatives at home, the suspect's mother and the 11-year-old stepbrother. That is flipping crazy, man. These are hard stories to cover. Now, in total, nine people have been killed, including the shooter themselves from a self-inflicted gunshot wound. Also, 27 others were also injured, and this is at a high school, so just the worst. Police have since identified the suspect as 18-year-old Jesse Van Root Stallar, who is a former student at the school and someone who is transgender. Now, when asked by the media about this, authorities said that he will be referring to the suspect as she because that's what Jesse identified as. &gt;&gt; We identify the suspect as they chose to be identified in public and in social media. I can say that Jesse was born as a biological male who approximately in the information that I have approximately six years ago began to transition to female and identified as female uh both socially and um publicly. &gt;&gt; Obviously, this has ignited yet another major debate online since this is not the first time that this has happened in even the last couple of years. Jesse also reportedly has a history of struggling with mental health, but police say that a motive for the attack remains unclear and may never be known. Now, of course, if this story has any major updates, I will make an update. But for now, okay, I feel like we're saying it a lot uh lately, and probably because there's a lot of signs of it. Is Hollywood cooked? Feel like we know the answer to this, but there's a new trend emerging on X. And actually, people are saying that this one specifically is the beginning of the end for stunt doubles. And this one video, which Alex is playing beside me or over me right now, is one of the main reasons that they're saying this. Now, I actually first saw this as I was scrolling through Twitter looking for some news stories. And that came up and I thought, \"Oh, it's just a a movie scene from a new movie that's been launched where Brad Pitt and Tom Cruz are fighting. I I haven't seen this one.\" Well, guess what? Then I read the caption and realized it was AI. That is insane. Dare I say probably one of the most insane AI moments I've had in a while. And I've had a lot of these. Anyway, videos like this have been making the rounds where they're having celebrities fight each other, you know, as part of a movie scene. And the accuracy of it is just insane. And apparently it's made with a new software called Sea Dance 2.0, which was just launched by none other than Bite Dance. You might be familiar with that name because they are the parent company of Tik Tok and Cap Cut. America, ban that too. But yeah, everyone online has been blown away with the accuracy of how good this realistic this looks. Honestly, it feels like every single month something like this comes out and it's just AI is just getting better and more realistic every month that passes. I mean the speed at which this technology is developing is something that I personally have never seen before. But let me know what you guys think. You know, could you tell that this was AI if you if you weren't told? Is this cool or should be we worried? Let me know. Moving on. Okay. Also, this week has been a very strange and bizarre one for uh laws around the world being passed starting in Switzerland because they are about to vote on a law which would limit their population to only 10 million. And this is a a historic first for them. So why? Well, in short, it's got to do with immigration. And the Swiss People's Party, the country's largest political party actually, uh they put are putting forth a vote in June, which if passed would require the government to refuse entry to immigrants once their population got to 9.5 million. Currently, they're at 9.1 million. But then, if the country continues to grow and it hits that 10 million number, the government would be forced to act yet again. And this time it's on the next level because they would be forced to freeze their free movement agreement. In fact, actually scrap it, not just freeze it. Uh which it has with other European countries. Now, the SVP claimed that Switzerland is having this population explosion and it's putting a lot of pressure on public services. It's straining infrastructure and inflating rents for the Swiss people. And even though this kind of measure sounds radical and extreme and most likely wouldn't be passed, there is a good chance that it might be actually because the SVP have won every single election in the country since 1999. So they hold a lot of weight in the government. But what do you guys think? Good idea? Bad idea? Let me know. Now, sticking with pretty significant laws being passed, Trump today has just carried out what the White House are describing as the largest deregulation in US history. That's pretty significant. He's actually revoked a scientific ruling, I think it was in 2009, that greenhouse gases are a danger to public health. And the reason why this is pretty incredibly significant is because this ruling is actually the foundation that underpins all federal actions on limiting planet warming gases. It includes motor vehicles, power plants, the oil and gas sector, methane from landfills, and even aircraft. The BBC report that environmental groups are saying that this move is by far the most significant roll back on climate change to date and they will be challenging it in courts. However, on the other side, the White House are claiming that this was one of the greatest scams in history, this scientific ruling, and that it massively drove up the prices for American consumers. They said that by overturning this regulation, it will save them more than $1 trillion. They didn't actually give a time frame or, you know, where will this money be coming from, uh, but they did say that it will help cut the prices of energy, transport, and the cost for automakers. Uh, that will be reduced by $2,400 per vehicle. And that's not even it for America when it comes to pretty significant new laws because the country could also be entering a new era with US voting laws as well. It's been a busy week. A new bill was just approved by the House called the Safeguard. It's basically called the Safe Act. I'm not even going to go through all the bloody names. And it won by a 218 to 213 vote. Now, to be officially passed, it will need to be approved in the Senate as well. But if it is, in the future, it will make it compulsory to have proof of US citizenship when registering to vote in federal elections. And that, as you will probably know, has been a very contentious and fiercely debated subject and political issue in the United States for years now. Those in favor of the bill, mainly Republicans, they argue that this is a necessary step to prevent election fraud and non-citizens from voting. However, those opposed to it, mainly Democrats, they believe that this puts an unnecessary burden on the voters, making it more difficult to participate in elections, potentially reducing voter turnout. And they also state that, you know, this isn't a big problem in the first place because non-citizens uh voting it's already pretty uh, you know, it's already illegal and extremely rare. And then lastly, I can't believe that I'm talking this much about laws, but look at this. &gt;&gt; Pow! Right in the kitchen. &gt;&gt; This is Turkey with new laws this this week. Now, this is footage of a massive brawl that broke out in Turkeykey's parliament. God damn. Look at the brother in the middle. He is throwing hay makers. Get Why is he a politician? Get him IN THE RING. &gt;&gt; POW! RIGHT IN THE KITCHEN. NOW APPARENTLY why this happened a little bit different to the previous stories about the law but apparently there was a controversial appointment of a new justice minister which has a lot of the other members of parliament not very happy clearly they believe that this individual has a history of silencing critics and protecting the government and so when some individuals tried to stop him from taking his oath THIS RIGHT MCKENZIE &gt;&gt; crazy fight broke out now a few minutes after the fighting calmed down peace was restored and this man was sworn in a bit later with protection around him. Wild. So yeah, pretty crazy week for the world's governments, but for now, right in the kitchen. Also this week, the Winter Olympics is in full swing. It's always it's always a good time when the Olympics is on in any capacity. But one of the most viral moments, and this one is tragic, tragically funny. I feel like that's a good description of this. A Norwegian skier decided to tell the entire world, and it really is the entire world at this point, that he cheated on his girlfriend after winning a bronze medal. That's that's got to be a first. So, after coming third in the men's 20k bathlon, the 28-year-old, he took all of us by surprise. But instead of saying, \"Oh, I'm so happy to win this thing. A lot of, you know, hard work went into it.\" No, he said infidelity. He said three months ago he cheated on the love of his life, the most beautiful and kindest person. He also referred to her as the gold medal of his life. &gt;&gt; Gold medal of his life. And he won bronze. He cheated on her. &gt;&gt; Yeah, get out. Shouldn't have got single medal. &gt;&gt; But he also said that sports has now taken a bit of a backseat in the past couple of days because he wish he could have shared this bronze medal with her. Yeah, I bet he wish he could have. Should have, would have, could have is what I say to that. &gt;&gt; Oh, he also said that this has been the worst week of his life despite winning an Olympic medal. He view he he also cried and he was very emotional. Do we forgive him? &gt;&gt; No. &gt;&gt; No. Really? &gt;&gt; Yawned to to that. &gt;&gt; Gosh. Just woke up and chose violence. &gt;&gt; Now, he also said that uh he thought and he was hoping that this public confession would help get her back. I'm assuming he's tried many other ways. Uh, and believe it or not, his ex-girlfriend has responded and it backfired a bit because I don't think she took it in the way that he thought she would. Speaking anonymously to a Norwegian outlet called VG, she said uh his infidelity was very hard to forgive even after such a declaration of love in front of the whole world. She also suggested that she wasn't very happy about this becoming so public. Yeah. The fact that news outlets are now having to reach out to her about her husband or no boyfriend, not even husband, cheating on her probably not ideal for her. She said, \"I did not choose to be put in this position and it hurts to have to be in it. We have been in contact and he is aware of my opinions on this.\" &gt;&gt; Watch this, Lee. You can actually pinpoint the second when his heart rips in half. Now, &gt;&gt; so yeah, now she's also pissed not only about cheating, but also uh that she's the whole thing is public now. &gt;&gt; Yeah, leave the poor guy alone. &gt;&gt; S has spoken. But what do you guys think? Do you think that he should be given one more chance or not? Moving on. Also, it's been a miserable start to the year uh for people in the UK because it has not stopped raining. Not once, every single day of the year in 2026 is rained. Gosh. Now, luckily, it's not the entire country where it's rained, but for a lot of parts like uh Devon, Cornwall, Worcester, um it's rained more than 40 consecutive days from 31st of December all the way to 8th of February, 2026. And you know what? 40 days of continuous rain in the Bible led to the world being flooded. So Iborn Noah from Ghana, if you were building your arcs in the UK right now, well, guess what? I would be clambering aboard because I would have believed you. Ibonoa's business would be booming. And not only that, but multiple weather records have been broken across the country because of this. In fact, 26 UK stations have now set new monthly records for the highest January rainfall. Gosh. And it's not just down at the bottom. Northern Ireland, in fact, they've had their wetest January for 149 years. Damn. Anyway, a moment of silence for all of those in the UK. Yes. Yes, us too. But turning it around to some positive news to end the video, which we do now. Okay. That's our that's a new thing that we do. Canada video finally went out. Any thoughts on the Canada video? You have to scream. &gt;&gt; Bloody fantastic. Yeah, bloody fantastic. Um, so just want to say thank you, Alex, for getting that one out. And a lot of people were saying, you know, for for like two weeks straight, where is the Canada video? Well, now you realize it was an hour and 20 minutes. And look at the level of editing and care that was put into it. Yeah. &gt;&gt; Work of art. &gt;&gt; Couldn't have said it any better myself. Scream that to the rooftops. &gt;&gt; A work of art. &gt;&gt; Damn right. It was a work of art. And uh that one was basically for you guys. That was a post to thank you guys for 1 million and uh show you guys how amazing uh Alex was because as you can see for those who have watched the video, he's got a good heart, a good soul. Now get back to work, you little man. &gt;&gt; Alex, I love you. &gt;&gt; [&nbsp;__&nbsp;] like miss you, man. &gt;&gt; Sorry, I just saw him smiling too much and taking putting his feet up. This has got to be out by Friday, Alex. So if it's late, guess what? I'm coming back to to Canada and firing you. &gt;&gt; Purpos are going to be late so you can come back just so you can hug again. &gt;&gt; Yeah, those hugs were pretty intense, weren't they? I really got carried away. Wrapped wrapped my legs around Alex as well. Sheesh. Uh anyway, um just wanted to say that I thank you for everything, guys. That video was only made possible because of your support because you decided to bend over and be sacrificial. Lami, lambs, lambs, l whatever, whatever. Anyway, gosh, let's stop the yapping and let's get wrapping up this video. Thank you for everything, guys, and hopefully we'll be back in our regular studio very soon. But until then, There's nothing breaking. There's nothing pow right in the kitchen"
}